<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#1.-Create-student-grades-DataFrame-object" data-toc-modified-id="1.-Create-student-grades-DataFrame-object-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>1. Create student grades DataFrame object</a></span><ul class="toc-item"><li><span><a href="#Create-a-column-named-passing_english-that-indicates-whether-each-student-has-a-passing-grade-in-reading." data-toc-modified-id="Create-a-column-named-passing_english-that-indicates-whether-each-student-has-a-passing-grade-in-reading.-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Create a column named <code>passing_english</code> that indicates whether each student has a passing grade in reading.</a></span></li><li><span><a href="#Sort-the-english-grades-by-the-passing_english-column.-How-are-duplicates-handled?" data-toc-modified-id="Sort-the-english-grades-by-the-passing_english-column.-How-are-duplicates-handled?-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Sort the english grades by the <code>passing_english</code> column. How are duplicates handled?</a></span></li><li><span><a href="#Sort-the-english-grades-first-by-passing_english-and-then-by-student-name." data-toc-modified-id="Sort-the-english-grades-first-by-passing_english-and-then-by-student-name.-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Sort the english grades first by <code>passing_english</code> and then by student <code>name</code>.</a></span></li><li><span><a href="#Sort-the-english-grades-first-by-passing_english,-and-then-by-the-actual-english-grade,-similar-to-how-we-did-in-the-last-step." data-toc-modified-id="Sort-the-english-grades-first-by-passing_english,-and-then-by-the-actual-english-grade,-similar-to-how-we-did-in-the-last-step.-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Sort the english grades first by <code>passing_english</code>, and then by the actual <code>english</code> grade, similar to how we did in the last step.</a></span></li><li><span><a href="#Calculate-each-students-overall-grade-and-add-it-as-a-column-on-the-DataFrame.-The-overall-grade-is-the-average-of-the-math,-english,-and-reading-grades." data-toc-modified-id="Calculate-each-students-overall-grade-and-add-it-as-a-column-on-the-DataFrame.-The-overall-grade-is-the-average-of-the-math,-english,-and-reading-grades.-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>Calculate each students overall grade and add it as a column on the DataFrame. The overall grade is the average of the math, english, and reading grades.</a></span></li></ul></li><li><span><a href="#2.-Load-the-mpg-dataset.-Read-the-documentation-for-the-dataset-and-use-it-for-the-following-questions:" data-toc-modified-id="2.-Load-the-mpg-dataset.-Read-the-documentation-for-the-dataset-and-use-it-for-the-following-questions:-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>2. Load the mpg dataset. Read the documentation for the dataset and use it for the following questions:</a></span><ul class="toc-item"><li><span><a href="#How-many-rows-and-columns-are-there?" data-toc-modified-id="How-many-rows-and-columns-are-there?-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>How many rows and columns are there?</a></span></li><li><span><a href="#What-are-the-data-types-of-each-column?" data-toc-modified-id="What-are-the-data-types-of-each-column?-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>What are the data types of each column?</a></span></li><li><span><a href="#Summarize-the-dataframe-with-the-.info()-and-.describe()-methods." data-toc-modified-id="Summarize-the-dataframe-with-the-.info()-and-.describe()-methods.-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Summarize the dataframe with the <code>.info()</code> and <code>.describe()</code> methods.</a></span></li><li><span><a href="#Rename-the-cty-column-to-city-and-hwy-to-highway-using-.rename()-method." data-toc-modified-id="Rename-the-cty-column-to-city-and-hwy-to-highway-using-.rename()-method.-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>Rename the <code>cty</code> column to <code>city</code> and <code>hwy</code> to <code>highway</code> using <code>.rename()</code> method.</a></span></li><li><span><a href="#Another-way-to-rename-columns..." data-toc-modified-id="Another-way-to-rename-columns...-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span>Another way to rename columns...</a></span></li><li><span><a href="#Do-any-cars-have-better-city-mileage-than-highway-mileage?" data-toc-modified-id="Do-any-cars-have-better-city-mileage-than-highway-mileage?-2.6"><span class="toc-item-num">2.6&nbsp;&nbsp;</span>Do any cars have better city mileage than highway mileage?</a></span></li><li><span><a href="#Create-a-column-named-mileage_difference;-this-column-should-contain-the-difference-between-highway-and-city-mileage-for-each-car." data-toc-modified-id="Create-a-column-named-mileage_difference;-this-column-should-contain-the-difference-between-highway-and-city-mileage-for-each-car.-2.7"><span class="toc-item-num">2.7&nbsp;&nbsp;</span>Create a column named <code>mileage_difference</code>; this column should contain the difference between highway and city mileage for each car.</a></span></li><li><span><a href="#Which-car-(or-cars)-has-the-highest-mileage-difference?" data-toc-modified-id="Which-car-(or-cars)-has-the-highest-mileage-difference?-2.8"><span class="toc-item-num">2.8&nbsp;&nbsp;</span>Which car (or cars) has the highest mileage difference?</a></span></li><li><span><a href="#Which-compact-class-car-has-the-lowest-highway-mileage?" data-toc-modified-id="Which-compact-class-car-has-the-lowest-highway-mileage?-2.9"><span class="toc-item-num">2.9&nbsp;&nbsp;</span>Which compact class car has the lowest highway mileage?</a></span></li><li><span><a href="#Create-a-column-named-average_mileage-that-is-the-mean-of-the-city-and-highway-mileage." data-toc-modified-id="Create-a-column-named-average_mileage-that-is-the-mean-of-the-city-and-highway-mileage.-2.10"><span class="toc-item-num">2.10&nbsp;&nbsp;</span>Create a column named <code>average_mileage</code> that is the mean of the city and highway mileage.</a></span></li><li><span><a href="#Which-Dodge-car-has-the-best-average-mileage?-The-worst?" data-toc-modified-id="Which-Dodge-car-has-the-best-average-mileage?-The-worst?-2.11"><span class="toc-item-num">2.11&nbsp;&nbsp;</span>Which Dodge car has the best average mileage? The worst?</a></span></li></ul></li><li><span><a href="#3.-Load-the-Mammals-dataset.-Read-the-documentation-for-it,-and-use-the-data-to-answer-these-questions:" data-toc-modified-id="3.-Load-the-Mammals-dataset.-Read-the-documentation-for-it,-and-use-the-data-to-answer-these-questions:-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>3. Load the Mammals dataset. Read the documentation for it, and use the data to answer these questions:</a></span><ul class="toc-item"><li><span><a href="#How-many-rows-and-columns-are-there?" data-toc-modified-id="How-many-rows-and-columns-are-there?-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>How many rows and columns are there?</a></span></li><li><span><a href="#What-are-the-data-types?" data-toc-modified-id="What-are-the-data-types?-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>What are the data types?</a></span></li><li><span><a href="#Summarize-the-dataframe-with-.info-and-.describe" data-toc-modified-id="Summarize-the-dataframe-with-.info-and-.describe-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Summarize the dataframe with .info and .describe</a></span></li><li><span><a href="#What-is-the-the-weight-of-the-fastest-animal?" data-toc-modified-id="What-is-the-the-weight-of-the-fastest-animal?-3.4"><span class="toc-item-num">3.4&nbsp;&nbsp;</span>What is the the weight of the fastest animal?</a></span></li><li><span><a href="#What-is-the-overall-percentage-of-specials?" data-toc-modified-id="What-is-the-overall-percentage-of-specials?-3.5"><span class="toc-item-num">3.5&nbsp;&nbsp;</span>What is the overall percentage of specials?</a></span></li><li><span><a href="#How-many-animals-are-hoppers-that-are-above-the-median-speed?-What-percentage-is-this?" data-toc-modified-id="How-many-animals-are-hoppers-that-are-above-the-median-speed?-What-percentage-is-this?-3.6"><span class="toc-item-num">3.6&nbsp;&nbsp;</span>How many animals are hoppers that are above the median speed? What percentage is this?</a></span></li></ul></li></ul></div>

<hr style="border-top: 10px groove turquoise; margin-top: 1px; margin-bottom: 1px"></hr>

# <font color=turquoise>Pandas DataFrames Exercises</font>

# Big Idea

**The Cycle of Improvement - James Clear (Atomic Habits)**

1. **Awareness -** identify what you need to improve.

2. **Deliberate practice -** focus your conscious effort on the specific area you want to improve.

3. **Habit -** with practice, the effortful becomes automatic.

4. **Repeat -** begin again.

# Objectives 

**By the end of the lesson and exercises, you will be able to...**

- **create subsets of data from a pandas DataFrame.**

```python
.loc[row_indexer, col_indexer]
.iloc[row_indexer, col_indexer]
df[bool_series]
```

- **create and manipulate columns in a pandas DataFrame.**

```python
.drop(columns=)
.rename(columns={'original_name': 'new_name')
.assign(new_column = some_expression_or_calculation)
```

- **sort the data in a pandas DataFrame.**

```python
.sort_values(by=column(s))
.sort_index(ascending=True)
```

- **chain methods to perform more complicated data manipulations.**

```python
df.drop().rename()
```

<hr style="border-top: 10px groove turquoise; margin-top: 1px; margin-bottom: 1px"></hr>

In [1]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
%matplotlib inline

from pydataset import data

<hr style="border-top: 10px groove turquoise; margin-top: 1px; margin-bottom: 1px"></hr>

### 1. Create student grades DataFrame object

In [2]:
np.random.seed(123)

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# randomly generate scores for each student for each subject
# note that all the values need to have the same length here

math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades})

___

**Peek at DataFrame**

In [3]:
df.head()

    name  math  english  reading
0  Sally    62       85       80
1   Jane    88       79       67
2  Suzie    94       74       95
3  Billy    98       96       88
4    Ada    77       92       98

In [4]:
# Use shape attribute

df.shape

(12, 4)

In [5]:
# Use info method to view both datatypes and potential missing values

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     12 non-null     object
 1   math     12 non-null     int64
 2   english  12 non-null     int64
 3   reading  12 non-null     int64
dtypes: int64(3), object(1)
memory usage: 512.0+ bytes

In [6]:
# Use the `.describe()` method to produce descriptive statistics for columns with numeric datatypes

df.describe()

            math    english    reading
count  12.000000  12.000000  12.000000
mean   84.833333  77.666667  86.500000
std    11.134168  13.371158   9.643651
min    62.000000  62.000000  67.000000
25%    78.500000  63.750000  80.750000
50%    90.000000  77.500000  89.000000
75%    92.250000  86.750000  93.250000
max    98.000000  99.000000  98.000000

___

#### a. Create a column named `passing_english` that indicates whether each student has a passing grade in reading.

In [7]:
# Create a boolean Series or a boolean mask that returns `True` for a passing English grade.

df.english >= 70

0      True
1      True
2      True
3      True
4      True
5      True
6     False
7     False
8     False
9      True
10     True
11    False
Name: english, dtype: bool

In [8]:
# Create a new column in our DataFrame and assign our boolean Series to it.

df['passing_english'] = df.english >= 70

In [9]:
# Check dataframe for new column.

df.head()

    name  math  english  reading  passing_english
0  Sally    62       85       80             True
1   Jane    88       79       67             True
2  Suzie    94       74       95             True
3  Billy    98       96       88             True
4    Ada    77       92       98             True

In [10]:
# How many people are passing English? Use the `.sum()` function to add the True bool (1) values.

df['passing_english'].sum()

8

In [11]:
# How many students are failing English? Use the `.sum()` function to add True values for failing.

df['passing_english'] == False

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7      True
8      True
9     False
10    False
11     True
Name: passing_english, dtype: bool

In [12]:
(df['passing_english'] == False).sum()

4

___

#### b. Sort the english grades by the `passing_english` column. How are duplicates handled?

- `.sort_values` returns a sorted copy of a given DataFrame unless `inplace=True`.

- It looks like duplicate values are handled according to the index value, small to large or ascending.

In [13]:
# DataFrame.sort_values(by, axis=0, ascending=True, inplace=False, kind='quicksort', na_position='last')
# sorts all of the rows in the DF using the column passed

df.sort_values(by='passing_english')

       name  math  english  reading  passing_english
6    Thomas    82       64       81            False
7     Marie    93       63       90            False
8    Albert    92       62       87            False
11     Alan    92       62       72            False
0     Sally    62       85       80             True
1      Jane    88       79       67             True
2     Suzie    94       74       95             True
3     Billy    98       96       88             True
4       Ada    77       92       98             True
5      John    79       76       93             True
9   Richard    69       80       94             True
10    Isaac    92       99       93             True

___

#### c. Sort the english grades first by `passing_english` and then by student `name`. 

All the students that are failing english should be first, and within the students who are failing english, they are ordered alphabetically. The same will be true for the students passing english. 

<div class="alert alert-block alert-info">
<b>Hint:</b> You can pass a list to the .sort_values method.
</div>

In [14]:
# Now we see that Alan comes before Albert because there is a secondary sort going on alphabetically by name

df.sort_values(by=['passing_english', 'name'])

       name  math  english  reading  passing_english
11     Alan    92       62       72            False
8    Albert    92       62       87            False
7     Marie    93       63       90            False
6    Thomas    82       64       81            False
4       Ada    77       92       98             True
3     Billy    98       96       88             True
10    Isaac    92       99       93             True
1      Jane    88       79       67             True
5      John    79       76       93             True
9   Richard    69       80       94             True
0     Sally    62       85       80             True
2     Suzie    94       74       95             True

In [15]:
# What if I want the students passing English first but names in alpha order?

df.sort_values(by=['passing_english', 'name'], ascending=[False, True])

       name  math  english  reading  passing_english
4       Ada    77       92       98             True
3     Billy    98       96       88             True
10    Isaac    92       99       93             True
1      Jane    88       79       67             True
5      John    79       76       93             True
9   Richard    69       80       94             True
0     Sally    62       85       80             True
2     Suzie    94       74       95             True
11     Alan    92       62       72            False
8    Albert    92       62       87            False
7     Marie    93       63       90            False
6    Thomas    82       64       81            False

___

#### d. Sort the english grades first by `passing_english`, and then by the actual `english` grade, similar to how we did in the last step.

In [16]:
df.sort_values(by=['passing_english', 'english'])

       name  math  english  reading  passing_english
8    Albert    92       62       87            False
11     Alan    92       62       72            False
7     Marie    93       63       90            False
6    Thomas    82       64       81            False
2     Suzie    94       74       95             True
5      John    79       76       93             True
1      Jane    88       79       67             True
9   Richard    69       80       94             True
0     Sally    62       85       80             True
4       Ada    77       92       98             True
3     Billy    98       96       88             True
10    Isaac    92       99       93             True

In [17]:
# Reverse my sort on both columns

df.sort_values(by=['passing_english', 'english'], ascending=[False, False])

       name  math  english  reading  passing_english
10    Isaac    92       99       93             True
3     Billy    98       96       88             True
4       Ada    77       92       98             True
0     Sally    62       85       80             True
9   Richard    69       80       94             True
1      Jane    88       79       67             True
5      John    79       76       93             True
2     Suzie    94       74       95             True
6    Thomas    82       64       81            False
7     Marie    93       63       90            False
8    Albert    92       62       87            False
11     Alan    92       62       72            False

___

#### e. Calculate each student's overall grade and add it as a column on the DataFrame. The overall grade is the average of the math, english, and reading grades.

The `.iloc` attribute allows me to access a group of rows and columns by their integer location or position. Notice below that the observations returned match the integer index location passed to `.iloc`, and **the indexing is NOT inclusive**. (from Series Review Notebook)

```python
df.iloc[row_indexer, column_indexer]
```

I could also solve this using `.loc` if I wanted to use **column labels** instead of index position.

```python
df.loc[:, 'math': 'reading']
```

In [18]:
# Here, I'm selecting all rows and columns at index positions 1, 2, 3. Now I can just sum them.

df.iloc[:, 1:4]

    math  english  reading
0     62       85       80
1     88       79       67
2     94       74       95
3     98       96       88
4     77       92       98
5     79       76       93
6     82       64       81
7     93       63       90
8     92       62       87
9     69       80       94
10    92       99       93
11    92       62       72

In [19]:
# Since I want the total of the columns in each row, I set axis=1 for columns.

df.iloc[:, 1:4].sum(axis=1)

0     227
1     234
2     263
3     282
4     267
5     248
6     227
7     246
8     241
9     243
10    284
11    226
dtype: int64

In [20]:
# Assign to variable and use the Series to create the calculated column I want on my df.

totals = df.iloc[:, 1:4].sum(axis=1)

In [21]:
# assign Series back to DataFrame as overall_grade

df['overall_average'] = round((totals / 3), 0).astype(int)
df.head()

    name  math  english  reading  passing_english  overall_average
0  Sally    62       85       80             True               76
1   Jane    88       79       67             True               78
2  Suzie    94       74       95             True               88
3  Billy    98       96       88             True               94
4    Ada    77       92       98             True               89

<hr style="border-top: 10px groove turquoise; margin-top: 1px; margin-bottom: 1px"></hr>

### 2. Load the mpg dataset. Read the documentation for the dataset and use it for the following questions:

In [22]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [23]:
mpg = data('mpg')

In [24]:
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

___

#### a. How many rows and columns are there?

In [25]:
mpg.shape

(234, 11)

In [26]:
print(f'There are {mpg.shape[0]} rows and {mpg.shape[1]} columns in the mpg DataFrame.')

There are 234 rows and 11 columns in the mpg DataFrame.

___

#### b. What are the data types of each column?

In [27]:
mpg.dtypes

manufacturer     object
model            object
displ           float64
year              int64
cyl               int64
trans            object
drv              object
cty               int64
hwy               int64
fl               object
class            object
dtype: object

___

#### c. Summarize the dataframe with the `.info()` and `.describe()` methods.

- `.info()` shows us that all of the columns have the same number of non-null values.

- `.describe()` provides us with the descriptive statistics for all columns with numeric dtypes.

In [28]:
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

In [29]:
mpg.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

___

#### d. Rename the `cty` column to `city` and `hwy` to `highway` using `.rename()` method.

- `.rename()` takes in a dictionary with the key as the original name and the value as the new name.

- If you want to change your original DataFrame to reflect your new column names, `inplace=True`

In [30]:
mpg.rename(columns={'cty': 'city', 'hwy': 'highway'}, inplace=True)

In [31]:
mpg.head(1)

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact

___

#### Another way to rename columns...

- This is another way you can rename columns, especially if you want to change many at once.

- I can use the `.columns` attribute to grab my column labels; I can go a step further and print out a list of the current columns in the DataFrame by adding the `.to_list()` method. It's not necessary if I'm just grabbing the column names, but I love getting the nice list.

- Then, I make any changes I want to the names in the list and reassign them to `df.columns`.

In [32]:
mpg = data('mpg')

In [33]:
mpg.columns.to_list()

['manufacturer',
 'model',
 'displ',
 'year',
 'cyl',
 'trans',
 'drv',
 'cty',
 'hwy',
 'fl',
 'class']

In [34]:
mpg.columns = ['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'city',
       'highway', 'fl', 'class']

In [35]:
mpg.head(1)

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact

___

#### e. Do any cars have better city mileage than highway mileage?

In [36]:
# Create a boolean Series or a boolean Mask

bool_series = mpg.city > mpg.highway
bool_series.head()

1    False
2    False
3    False
4    False
5    False
dtype: bool

In [37]:
# Return a subset of the original DataFrame using the indexing operator.

mpg[bool_series]

Empty DataFrame
Columns: [manufacturer, model, displ, year, cyl, trans, drv, city, highway, fl, class]
Index: []

In [38]:
# I can do a quick check to validate my findings above. There are no observations that meet this condition.

bool_series.sum()

0

___

#### f. Create a column named `mileage_difference`; this column should contain the difference between highway and city mileage for each car.

- You saw above how to create a new column in a df using bracket notation; this time I'll show you how to create a new column in a df using the `.assign()` method.

- They are both valid ways to create a new column; if you want to create more than one column at once, `.assign()` is worth looking into. Choose your flavor...

In [39]:
# This operation returns a Series of differences in mileage for each row. Looks good.

mpg.highway - mpg.city

1      11
2       8
3      11
4       9
5      10
       ..
230     9
231     8
232    10
233     8
234     9
Length: 234, dtype: int64

In [40]:
# This is how I can create a new column in my df from a calculation on two existing columns.
# I can reassign to my original df at this point, or I might want to assign to a new df name.

mpg = mpg.assign(mileage_difference = mpg.highway - mpg.city)

In [41]:
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10

___

#### g. Which car (or cars) has the highest mileage difference?

In [42]:
# Use the `.max()` function to find the max value in the column.

mpg.mileage_difference.max()

12

In [43]:
# Create a boolean Series where `True` values identify a match with the max mileage_difference. 

bool_series = mpg.mileage_difference == mpg.mileage_difference.max()
bool_series.head()

1    False
2    False
3    False
4    False
5    False
Name: mileage_difference, dtype: bool

In [44]:
# Pass my bool_series as a selector for rows in my mpg Series.

mpg[bool_series]

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference
107,honda,civic,1.8,2008,4,auto(l5),f,24,36,c,subcompact,12
223,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact,12

In [45]:
# I can get more specific if I like...

mpg[bool_series][['manufacturer', 'model']]

    manufacturer       model
107        honda       civic
223   volkswagen  new beetle

___

#### h. Which compact class car has the lowest highway mileage?

In [46]:
# Why doesn't this work??? This is an example of a situation where you have to use bracket notation

mpg.class

SyntaxError: invalid syntax (<ipython-input-46-4e43ef5af34c>, line 3)

In [ ]:
# I check and see that I have a column named `class`. What's up?
# 'class' is a reserved word, so I have to use bracket notation to access the column!

mpg.columns

In [ ]:
# I'm taking a look at all of the possible values in the column here.

mpg['class'].value_counts()

In [ ]:
# Create the bool Series or selector for the compact class of cars.

bool_series = mpg['class'] == 'compact'
bool_series.head()

In [ ]:
# Pass my selector to my original DataFrame to get a subset of compact cars.

compacts = mpg[bool_series]
compacts.head()

In [ ]:
# Sort the DataFrame by highway mileage

compacts.sort_values(by='highway').head()

In [ ]:
# If you want to isolate the compact car with the lowest highway mileage

compacts.sort_values(by='highway').head(1)

**The best highway mileage?**

In [ ]:
# Isolate the compact car with the best highway mileage.

compacts.sort_values(by='highway', ascending=False).head()

In [ ]:
# isolate the row using .head() method

compacts.sort_values(by='highway', ascending=False).head(1)

___

####  j. Create a column named `average_mileage` that is the mean of the city and highway mileage.

In [ ]:
# Create the calculated column

(mpg.city + mpg.highway) / 2

In [ ]:
# Assign the Series back to the original DataFrame as a new column.

mpg['average_mileage'] = (mpg.city + mpg.highway) / 2

In [ ]:
mpg.head(2)

___

#### k. Which Dodge car has the best average mileage? The worst?

In [ ]:
# Create the boolean Series to filter for Dodge vehicles.

bool_series = mpg.manufacturer == 'dodge'
bool_series.head()

In [ ]:
# Use the selector to create a subset of only Dodge vehicles.

dodges = mpg[bool_series]
dodges.head()

In [ ]:
# Isolate the Dodge with the best average mileage.

dodges.sort_values(by='average_mileage').tail(1)

In [ ]:
# Isolate the Dodge with the worst average mileage.

dodges.sort_values(by='average_mileage').head(1)

<hr style="border-top: 10px groove turquoise; margin-top: 1px; margin-bottom: 1px"></hr>

### 3. Load the Mammals dataset. Read the documentation for it, and use the data to answer these questions:

In [ ]:
data('Mammals', show_doc=True)

In [ ]:
# Load DataFrame and save as `mammals`.

mammals = data('Mammals')

In [ ]:
mammals.head()

___

#### a. How many rows and columns are there?

In [ ]:
mammals.shape

___

#### b. What are the data types?

In [ ]:
mammals.dtypes

___

#### c. Summarize the dataframe with .info and .describe

In [ ]:
mammals.info()

In [ ]:
mammals.describe()

**Quick visualization of the distributioin of weight and speed values**

In [ ]:
plt.hist(mammals.weight, bins=20, color='orange', edgecolor='black')

plt.title('Weight of Mammals in kg')
plt.xlabel('kg')
plt.ylabel('Count')

plt.show()

In [ ]:
plt.hist(mammals.speed, bins=15, color='dodgerblue', edgecolor='black')

plt.title('Full Sprint Speed of Mammals in km')
plt.xlabel('km')
plt.ylabel('Count')

plt.show()

___

#### d. What is the the weight of the fastest animal?

In [ ]:
# Find the fastest speed using max(). I see there is only one observation with 110 km.

mammals.speed.value_counts().sort_index(ascending=False).head()

In [ ]:
# I can isolate that observation/mammal using the `.loc` indexer and `.idxmax()` method.

mammals.loc[mammals.speed.idxmax()]

In [ ]:
# You guessed it; it's a Series! I can access any of those index labels or values.

type(mammals.loc[mammals.speed.idxmax()])

In [ ]:
mammals.loc[mammals.speed.idxmax()].weight

In [ ]:
# OR -> I can create a boolan Series to filter for observations that match the max speed.

bool_series = mammals.speed == mammals.speed.max()
bool_series.head()

In [ ]:
# Pass my boolean Series to the indexing operator as a selector to find observations that match the fastest speed

mammals[bool_series]

In [ ]:
# Isolate the weight value if you want like this...

mammals[bool_series].weight

In [ ]:
# or like this. Again, your context will dictate the data you want to return and how you get it.

mammals.loc[mammals.speed.idxmax()].weight

___

#### e. What is the overall percentage of specials?

In [ ]:
# We have a boolean Series already.

mammals.specials.head()

In [ ]:
# First, I'll find the number of mammals classified as specials.
# True boolean values are understood as having a value of 1, so I can sum the boolean Series.

total_specials = mammals.specials.sum()
total_specials

In [ ]:
# Find the total number of mammals in my df.

total_mammals = len(mammals)
total_mammals

In [ ]:
print(f'{round(total_specials / total_mammals * 100, 2)}% of mammals in the df are specials.')

___

#### f. How many animals are hoppers that are above the median speed? What percentage is this?

- I interpreted this question as animals that are hoppers AND above the median speed for all mammals in our DataFrame.

In [ ]:
mammals.head(1)

In [ ]:
# Find the median speed of mammals in our df.

median_speed = mammals.speed.median()
median_speed

In [ ]:
# Create boolean Series for mammals with speed above `median_speed` and True for hoppers

bool_series = (mammals.speed > median_speed) & (mammals.hoppers == True)
bool_series.head()

In [ ]:
# These are our fast hoppers.

fast_hoppers = mammals[bool_series]
fast_hoppers

In [ ]:
print(f'This puts fast hoppers at {round((len(fast_hoppers) / len(mammals)) * 100, 2)}% of the mammals.')